from langchain.agents import AgentType, initialize_agent, load_tools
from adjustment.openai import ChatOpenAI

llm = ChatOpenAI(
    model_name='Qwen',
    openai_api_base='http://localhost:8001/v1',
    openai_api_key='EMPTY',
    streaming=False,
)
print(llm.predict('给你一些数据：00040120A\t毽球初级1\t1\t周梅芳\t周四 1-2节 1-16周 体育馆西侧\t鼓楼校区\t27/32\n00040020B\t游泳提高4\t1\t赵岚\t周四 1-2节 1-16周 游泳馆\t鼓楼校区\t62/30\n00040090A\t乒乓球初级7\t1\t殷飞\t周四 1-2节 1-16周 吕志和四楼\t鼓楼校区\t142/30\n\t\t\t\t\t\t\n00040200A\t跆拳道初级9\t1\t罗萍娟\t周四 5-6节 1-16周 吕志和三楼\t鼓楼校区\t13/30\n00040200A\t跆拳道初级3\t1\t李文龙\t周一 5-6节 1-16周 吕志和三楼\t鼓楼校区\t13/30\n00042030\t柔力球初级3\t1\t吕艳玲\t周二 5-6节 1-16周 吕志和三楼\t鼓楼校区\t16/32\n\t\t\t\t\t\t\n00040290A\t健美初级1\t1\t陈思远\t周三 1-2节 1-16周 健身房\t鼓楼校区\t44/32\n00040260\t健身排舞1\t1\t唐苏丽\t周三 1-2节 1-16周 体育馆东侧\t鼓楼校区\t53/32\n00040050A\t排球初级4\t1\t王喆\t周三 1-2节 1-16周 篮球场\t鼓楼校区\t65/32\n00040230A\t体育舞蹈初级7\t1\t姜艳\t周三 1-2节 1-16周 吕志和三楼\t鼓楼校区\t47/32\n00040230A\t体育舞蹈初级8\t1\t谢云龙\t周三 1-2节 1-16周 吕志和一楼\t鼓楼校区\t36/32\n00040100A\t羽毛球初级6\t1\t陈樨\t周三 1-2节 1-16周 体育馆西侧\t鼓楼校区\t225/32\n00040200A\t跆拳道初级4\t1\t罗萍娟\t周三 1-2节 1-16周 吕志和三楼\t鼓楼校区\t23/30\n00042020\t减脂理论与实践1\t1\t陈刚\t周四 1-2节 1-16周 吕志和一楼\t鼓楼校区\t102/30\n00040090A\t乒乓球初级7\t1\t殷飞\t周四 1-2节 1-16周 吕志和四楼\t鼓楼校区\t142/30\n00040460\t武术1\t1\t熊轩\t周四 1-2节 1-16周 吕志和三楼\t鼓楼校区\t70/32\n00040100A\t羽毛球初级9\t1\t邵力平\t周四 1-2节 1-16周 体育馆东侧\t鼓楼校区\t282/32\n00040120A\t毽球初级1\t1\t周梅芳\t周四 1-2节 1-16周 体育馆西侧\t鼓楼校区\t27/32\n00040200A\t跆拳道初级7\t1\t罗萍娟\t周四 1-2节 1-16周 吕志和三楼\t鼓楼校区\t15/30\n00040230A\t体育舞蹈初级13\t1\t谢云龙\t周五 1-2节 1-16周 吕志和一楼\t鼓楼校区\t42/32\n00040280A\t瑜伽初级4\t1\t胡艳\t周五 1-2节 1-16周 吕志和三楼\t鼓楼校区\t67/32\n00040230A\t体育舞蹈初级14\t1\t谢云龙\t周五 3-4节 1-16周 吕志和一楼\t鼓楼校区\t55/32\n00040280A\t瑜伽初级5\t1\t胡艳\t周五 3-4节 1-16周 吕志和三楼\t鼓楼校区\t60/32\n00040020B\t游泳提高4\t1\t赵岚\t周四 1-2节 1-16周 游泳馆\t鼓楼校区\t62/30\n\n\n请帮我分析一下哪些课还能报'))